<a href="https://colab.research.google.com/github/modzirator/jija/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

In [3]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [5]:
names = ["ID", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns={'ID'})
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [18]:
data['Class'].replace(
                      {
                       1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps",
                       },
                       inplace=True)    
data.head(7)

        RI     Na    Mg    Al     Si     K    Ca   Ba    Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.00  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.00  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.00  building_float
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.00  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.00  building_float
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.0  0.26  building_float
6  1.51743  13.30  3.60  1.14  73.09  0.58  8.17  0.0  0.00  building_float

In [21]:
for col in data .columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

# Data Visualization

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      184 non-null    float64
 1   Na      185 non-null    float64
 2   Mg      188 non-null    float64
 3   Al      185 non-null    float64
 4   Si      184 non-null    float64
 5   K       182 non-null    float64
 6   Ca      193 non-null    float64
 7   Ba      186 non-null    float64
 8   Fe      183 non-null    float64
 9   Class   182 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [24]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  184.000000  185.000000  188.000000  ...  193.000000  186.000000  183.000000
mean     1.518362   13.368324    2.702926  ...    8.977254    0.187366    0.060601
std      0.003153    0.730094    1.419499  ...    1.488395    0.517403    0.100401
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516460   12.930000    2.197500  ...    8.220000    0.000000    0.000000
50%      1.517670   13.270000    3.480000  ...    8.590000    0.000000    0.000000
75%      1.519165   13.800000    3.592500  ...    9.260000    0.000000    0.100000
max      1.533930   15.150000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [28]:
display(data["Class"].describe() )
print("'''''''''''''''''''''''''''''''")
display( data['Class'].value_counts() )

count                    182
unique                     6
top       building_non_float
freq                      68
Name: Class, dtype: object

'''''''''''''''''''''''''''''''

building_non_float    68
building_float        61
headlamps             22
vehicle_float         12
containers            11
tableware              8
Name: Class, dtype: int64